# vsoWidgetPopupSet

## Description
```pascal
PROCEDURE vsoWidgetPopupSet(
				widgetID : LONGINT;
				index    : LONGINT;
				id       : STRING;
				text     : STRING);
```

```python

def vs.vsoWidgetPopupSet(widgetID, index, id, text):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|index|LONGINT||
|id|STRING||
|text|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events